Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkValues.AddValue(Autodesk.Revit.DB.ForgeTypeId,System.String)
Add a string value for a given schema id.
schemaId:
Identifier of the schema.
value:
The string value.
Returns:
True if the data was added, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkValues.AddValue(Autodesk.Revit.DB.ForgeTypeId,System.Double)
Add a double value for a given schema id.
schemaId:
Identifier of the schema.
value:
The double value in the storage unit of schema.
Returns:
True if the data was added, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkValues.AddValue(Autodesk.Revit.DB.ForgeTypeId,System.Int32)
Add an integer value for a given schema id.
schemaId:
Identifier of the schema.
value:
The integer value.
Returns:
True if the data was added, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkValues.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkValues.#ctor
Creates a new ExtendedPropertiesLinkValues.
Since:
2027

Autodesk.Revit.DB.ExternalData.ExtendedPropertiesLinkValues
Holds information which can be converted to Revit parameter values
Since:
2027